<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Sony Catalyst Browse disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.fkick.tgroup-recipe.munki.catalystbrowse</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Catalyst Browse</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Sony</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Catalyst Browse, a cross-platform viewing and logging tool for all Sony Pro formats, offers streamlined media management that simplifies your workflow and secures your content.</string>
            <key>display_name</key>
            <string>Sony Catalyst Browse</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>DIT</string>
            <key>developer</key>
            <string>Sony</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.fkick.tgroup-recipe.download.catalystbrowse</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
