<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the latest version of Jump Desktop.</string>
    <key>Identifier</key>
    <string>com.github.fkick.tgroup.download.Jump Desktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Jump Desktop</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://mirror.jumpdesktop.com/downloads/jdm/jdmac-web-appcast.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/Jump Desktop/%NAME%.app</string>
			</dict>
    	</dict>
    	<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pkg_path%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
