<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest ShotPutPro zip file.</string>
    <key>Identifier</key>
    <string>com.nerdypup.download.shotputpro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShotPutPro6</string>
        <key>SU_FEED_URL</key>
        <string>https://activation.imagineproducts.cloud/updates/mac/BD7A600E-6976-460A-B446-B3AF53D761A9/2023/1/2</string>
        <key>filename</key>
        <string>ShotPutPro.app.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SU_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict><dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
