<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest ShotPutPro zip file and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.nerdypup.munki.shotputpro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShotPutPro</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/ImagineProducts</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ShotPut Pro for Macintosh is an automated copy utility application for HD video, audio and photo files. It makes secure copies of a card’s contents, entire hard disks or digital recorders, or selected files to multiple locations simultaneously.</string>
            <key>display_name</key>
            <string>ShotPutPro</string>
            <key>icon_name</key>
			<string>ShotPutPro24.png</string>
			<key>category</key>
			<string>DIT</string>
			<key>developer</key>
			<string>Imagine Products</string>
			<key>minimum_os_version</key>
			<string>11.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.nerdypup.download.shotputpro</string>
    <key>Process</key>
    <array>
        <dict>
        	<key>Processor</key>
        	<string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/ShotPutPro.dmg</string>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/ShotPutPro/ShotPutPro.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/ShotPutPro.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%dmg_path%</string>
                    <string>%RECIPE_CACHE_DIR%/ShotPutPro/</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
