<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest ShotPutPro zip file and creates a pkg.</string>
    <key>Identifier</key>
    <string>com.nerdypup.pkg.shotputpro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShotPutPro 6</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.nerdypup.download.shotputpro</string>
    <key>Process</key>
    <array>
          
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/ShotPutPro/ShotPutPro.app</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/ShotPutPro-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
