<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest ShotPutPro 6 zip file.</string>
    <key>Identifier</key>
    <string>com.github.fkick.tgroup-recipe.download.shotputpro6</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShotPutPro6</string>
        <key>SU_FEED_URL</key>
        <string>https://rink.hockeyapp.net/api/2/apps/848b78142a44455182f339900a138dac</string>
        <key>filename</key>
        <string>ShotPutPro_6.app.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SU_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict><dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
