<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest ShotPutPro 6 zip file and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.fkick.tgroup-recipe.munki.shotputpro6</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShotPutPro 6</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/ImagineProducts</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ShotPut Pro™ for Macintosh is an automated copy utility application for HD video, audio and photo files. It makes secure copies of a card’s contents, entire hard disks or digital recorders, or selected files to multiple locations simultaneously. Version 6 for Macintosh introduces a new user interface with a color-coded progress window, in-depth folder naming options, pause and resume processing, ‘video aware’ reports with metadata and thumbnails, Finder tags and more.</string>
            <key>display_name</key>
            <string>ShotPutPro 6</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.fkick.tgroup-recipe.pkg.shotputpro6</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/ShotPutPro 6.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
